package remaining200_gt.medium;

/**
 * 给定一个整数数组，其中第 i 个元素代表了第 i 天的股票价格 。​

设计一个算法计算出最大利润。在满足以下约束条件下，你可以尽可能地完成更多的交易（多次买卖一支股票）:

你不能同时参与多笔交易（你必须在再次购买前出售掉之前的股票）。
卖出股票后，你无法在第二天买入股票 (即冷冻期为 1 天)。
 */

 //动态规划，二维的，记录每个位置的不同状态
class Solution {
    public int maxProfit(int[] prices) {
        int n = prices.length;
        int[][] dp = new int[n][3];
        //这里第i+1天是冷冻期表示第i天结束后到第i+1天结束为冷冻期，即dp[i]对应的位置
        //dp[i][0]表示第i（i从0开始）天结束后（即第1天开始时）没有股票在手且不处于冷冻期时的利润
        //dp[i][1]表示第i（i从0开始）天结束后没有股票在手但处于冷冻期时的利润
        //dp[i][2]表示第i（i从0开始）天结束后有股票在手时的利润
        dp[0][0] = 0;
        dp[0][1] = 0; //第一天不可能有这种情况，只需要将该值设置不大于dp[0][0]即可
        dp[0][2] = -prices[0];
        for (int i = 1; i < n; i++) {
            //第i天没有股票且不处于冷冻期有两种情况：
            //1、前一天也是这个状态
            //2、前一天为冷冻期，即刚把股票卖了
            dp[i][0] = Math.max(dp[i-1][0], dp[i-1][1]);
            dp[i][1] = dp[i-1][2] + prices[i];
            dp[i][2] = Math.max(dp[i-1][2], dp[i-1][0]-prices[i]);
        }
        return Math.max(dp[n-1][0], dp[n-1][1]);

        //可以进一步空间优化，因为只有三个状态，用三个变量存起来就行
        
    } 
}

public class Question309 {
    
}
