package 每日一题;

/**
 * 给你两个正整数数组 nums1 和 nums2 ，数组的长度都是 n 。

数组 nums1 和 nums2 的 绝对差值和 定义为所有 |nums1[i] - nums2[i]|（0 <= i < n）的 总和（下标从 0 开始）。

你可以选用 nums1 中的 任意一个 元素来替换 nums1 中的 至多 一个元素，以 最小化 绝对差值和。

在替换数组 nums1 中最多一个元素 之后 ，返回最小绝对差值和。因为答案可能很大，所以需要对 109 + 7 取余 后返回。

|x| 定义为：

如果 x >= 0 ，值为 x ，或者
如果 x <= 0 ，值为 -x
 */

 //刚开始想错了，不是找原始差值最大的那个进行替换
 //而是对每一个元素都要进行查找，找到能使得sum值减小最多的那个元素进行替换
 //防止出现类似[1,28,21]，[9,21,20]这种的情况出现
 //注：上面的情况如果按最开始的方法来做，就会替换nums1中的“1”，导致出错
class Solution {
    public int minAbsoluteSumDiff(int[] nums1, int[] nums2) {
        int n = nums1.length;
    }
}

public class _7_14_Q1818 {
    
}
